prosjekter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="no" xml:lang="no">
<head>
<!-- 2018-07-31 tir. 20:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prosjektoppgaver</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tarjei Bærland" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css">
<link href='https://fonts.googleapis.com/css?family=Open Sans' rel='stylesheet'>
<link href='https://fonts.googleapis.com/css?family=Source Code Pro' rel='stylesheet'>


</head>
<body>
<div id="content">
<h1 class="title">Prosjektoppgaver</h1>
<div id="table-of-contents">
<h2>Innhold</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb092ca3">Største felles divisor</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb092ca3" class="outline-2">
<h2 id="orgb092ca3">Største felles divisor</h2>
<div class="outline-text-2" id="text-orgb092ca3">
<p>
Innenfor tallteori er to talls største felles divisor (<i>greates common divisor</i>) en vesentlig egenskap å kunne avgjøre. Målet med denne oppgaven er å lage en funksjoner <code>sfd</code>, med to argumenter <code>a</code> og <code>b</code>, som returnerer <code>a</code> og <code>b</code> sine største felles divisor.
</p>
</div>

<div id="outline-container-orgc65c831" class="outline-3">
<h3 id="orgc65c831">Oppgave</h3>
<div class="outline-text-3" id="text-orgc65c831">
<p>
Vi har et rom som er 221 dm bredt og 595 dm langt. Om vi skal flislegge gulvet i dette rommet med hele kvadratiske fliser, hva er den største sidelengden flisene kan ha?
</p>
</div>
</div>

<div id="outline-container-orgdf27a41" class="outline-3">
<h3 id="orgdf27a41">En elementær tilnærming</h3>
<div class="outline-text-3" id="text-orgdf27a41">
<p>
For to tall, <code>a</code> og <code>b</code>, hvor <code>b &lt; a</code>, kan deres <i>sfd</i> være maksimalt <code>b/2</code>.
</p>

<div class="TASK">
<p>
Argumenter for foregående setning.
</p>

</div>

<p>
Dersom <code>sfd(a,b) == 1</code> har <code>a</code> og <code>b</code> <i>ingen</i> felles divisorer større enn én, vi sier da at <code>a</code> og <code>b</code> <i>relativt primistiske</i>. For å finne en eventuell <i>sfd</i> for <code>a</code> og <code>b</code>, kan vi da teste alle tall fra 1 til <code>b/2</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">sfd_elementaer</span>(a, b):
    <span class="org-doc">"""Returner st&#248;rste felles divisor for heltallene a og b."""</span>

    <span class="org-keyword">if</span> a &gt; b:
        <span class="org-variable-name">a</span>, <span class="org-variable-name">b</span> = b, a

    <span class="org-variable-name">sfd</span> = 1                     <span class="org-comment-delimiter"># </span><span class="org-comment">Holder denne verdien er a og b relativt primistiske</span>
    <span class="org-variable-name">test</span> = 1

    <span class="org-keyword">while</span> test &lt;= b/2:
        <span class="org-keyword">if</span> a % test == 0 <span class="org-keyword">and</span> b % test == 0:
            <span class="org-variable-name">sfd</span> = test
        <span class="org-variable-name">test</span> += 1

    <span class="org-keyword">return</span> sfd
</pre>
</div>

<div class="TASK">
<p>
Denne testen er ineffektiv. Blant annet sjekker den alle partall, uavhengig av om <code>a</code> eller <code>b</code> er oddetall. Endre funksjonen til å være slik <code>test</code> økes med 2 i oddetallssteg (1, 3, 5, &#x2026;) dersom  enten <code>a</code> eller <code>b</code> er oddetall.
</p>

</div>

<div class="TASK">
<p>
Lag en predikatfunksjon som svarer på hvorvidt <code>a</code> og <code>b</code> er relativt primistiske.
</p>

</div>
</div>
</div>

<div id="outline-container-org0d69df1" class="outline-3">
<h3 id="org0d69df1"><span class="todo TODO">TODO</span> Euklids algoritme</h3>
<div class="outline-text-3" id="text-org0d69df1">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> numpy <span class="org-keyword">as</span> np
<span class="org-keyword">import</span> matplotlib.pyplot <span class="org-keyword">as</span> plt
<span class="org-keyword">from</span> matplotlib.patches <span class="org-keyword">import</span> Rectangle

<span class="org-variable-name">width</span> = 221
<span class="org-variable-name">height</span> = 595

<span class="org-variable-name">fig</span>, <span class="org-variable-name">ax</span> = plt.subplots(1)



<span class="org-variable-name">rect</span> = Rectangle((0, 0), width, height, linewidth=1, edgecolor=<span class="org-string">'b'</span>, facecolor=<span class="org-string">'none'</span>)
ax.set_autoscale_on(<span class="org-constant">False</span>)

ax.add_patch(rect)

plt.show()
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> numpy <span class="org-keyword">as</span> np
<span class="org-keyword">import</span> matplotlib.pyplot <span class="org-keyword">as</span> plt
<span class="org-keyword">from</span> matplotlib.patches <span class="org-keyword">import</span> Rectangle


<span class="org-comment-delimiter"># </span><span class="org-comment">We just subclass Rectangle so that it can be called with an Axes</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">instance, causing the rectangle to update its shape to match the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">bounds of the Axes</span>
<span class="org-keyword">class</span> <span class="org-type">UpdatingRect</span>(Rectangle):
    <span class="org-keyword">def</span> <span class="org-function-name">__call__</span>(<span class="org-keyword">self</span>, ax):
        <span class="org-keyword">self</span>.set_bounds(*ax.viewLim.bounds)
        ax.figure.canvas.draw_idle()


<span class="org-comment-delimiter"># </span><span class="org-comment">A class that will regenerate a fractal set as we zoom in, so that you</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">can actually see the increasing detail.  A box in the left panel will show</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the area to which we are zoomed.</span>
<span class="org-keyword">class</span> <span class="org-type">MandelbrotDisplay</span>(<span class="org-builtin">object</span>):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, h=500, w=500, niter=50, radius=2., power=2):
        <span class="org-keyword">self</span>.height = h
        <span class="org-keyword">self</span>.width = w
        <span class="org-keyword">self</span>.niter = niter
        <span class="org-keyword">self</span>.radius = radius
        <span class="org-keyword">self</span>.power = power

    <span class="org-keyword">def</span> <span class="org-function-name">__call__</span>(<span class="org-keyword">self</span>, xstart, xend, ystart, yend):
        <span class="org-keyword">self</span>.x = np.linspace(xstart, xend, <span class="org-keyword">self</span>.width)
        <span class="org-keyword">self</span>.y = np.linspace(ystart, yend, <span class="org-keyword">self</span>.height).reshape(-1, 1)
        <span class="org-variable-name">c</span> = <span class="org-keyword">self</span>.x + 1.0j * <span class="org-keyword">self</span>.y
        <span class="org-variable-name">threshold_time</span> = np.zeros((<span class="org-keyword">self</span>.height, <span class="org-keyword">self</span>.width))
        <span class="org-variable-name">z</span> = np.zeros(threshold_time.shape, dtype=<span class="org-builtin">complex</span>)
        <span class="org-variable-name">mask</span> = np.ones(threshold_time.shape, dtype=<span class="org-builtin">bool</span>)
        <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(<span class="org-keyword">self</span>.niter):
            <span class="org-variable-name">z</span>[mask] = z[mask]**<span class="org-keyword">self</span>.power + c[mask]
            <span class="org-variable-name">mask</span> = (np.<span class="org-builtin">abs</span>(z) &lt; <span class="org-keyword">self</span>.radius)
            <span class="org-variable-name">threshold_time</span> += mask
        <span class="org-keyword">return</span> threshold_time

    <span class="org-keyword">def</span> <span class="org-function-name">ax_update</span>(<span class="org-keyword">self</span>, ax):
        ax.set_autoscale_on(<span class="org-constant">False</span>)  <span class="org-comment-delimiter"># </span><span class="org-comment">Otherwise, infinite loop</span>

        <span class="org-comment-delimiter"># </span><span class="org-comment">Get the number of points from the number of pixels in the window</span>
        <span class="org-variable-name">dims</span> = ax.patch.get_window_extent().bounds
        <span class="org-keyword">self</span>.width = <span class="org-builtin">int</span>(dims[2] + 0.5)
        <span class="org-keyword">self</span>.height = <span class="org-builtin">int</span>(dims[2] + 0.5)

        <span class="org-comment-delimiter"># </span><span class="org-comment">Get the range for the new area</span>
        <span class="org-variable-name">xstart</span>, <span class="org-variable-name">ystart</span>, <span class="org-variable-name">xdelta</span>, <span class="org-variable-name">ydelta</span> = ax.viewLim.bounds
        <span class="org-variable-name">xend</span> = xstart + xdelta
        <span class="org-variable-name">yend</span> = ystart + ydelta

        <span class="org-comment-delimiter"># </span><span class="org-comment">Update the image object with our new data and extent</span>
        <span class="org-variable-name">im</span> = ax.images[-1]
        im.set_data(<span class="org-keyword">self</span>.__call__(xstart, xend, ystart, yend))
        im.set_extent((xstart, xend, ystart, yend))
        ax.figure.canvas.draw_idle()

<span class="org-variable-name">md</span> = MandelbrotDisplay()
<span class="org-variable-name">Z</span> = md(-2., 0.5, -1.25, 1.25)

fig1, (ax1, ax2) = plt.subplots(1, 2)
ax1.imshow(Z, origin=<span class="org-string">'lower'</span>, extent=(md.x.<span class="org-builtin">min</span>(), md.x.<span class="org-builtin">max</span>(), md.y.<span class="org-builtin">min</span>(), md.y.<span class="org-builtin">max</span>()))
ax2.imshow(Z, origin=<span class="org-string">'lower'</span>, extent=(md.x.<span class="org-builtin">min</span>(), md.x.<span class="org-builtin">max</span>(), md.y.<span class="org-builtin">min</span>(), md.y.<span class="org-builtin">max</span>()))

<span class="org-variable-name">rect</span> = UpdatingRect([0, 0], 0, 0, facecolor=<span class="org-string">'None'</span>, edgecolor=<span class="org-string">'black'</span>, linewidth=1.0)
rect.set_bounds(*ax2.viewLim.bounds)
ax1.add_patch(rect)

<span class="org-comment-delimiter"># </span><span class="org-comment">Connect for changing the view limits</span>
ax2.callbacks.connect(<span class="org-string">'xlim_changed'</span>, rect)
ax2.callbacks.connect(<span class="org-string">'ylim_changed'</span>, rect)

ax2.callbacks.connect(<span class="org-string">'xlim_changed'</span>, md.ax_update)
ax2.callbacks.connect(<span class="org-string">'ylim_changed'</span>, md.ax_update)
ax2.set_title(<span class="org-string">"Zoom here"</span>)

plt.show()
</pre>
</div>
</div>


<div id="outline-container-orgbe37290" class="outline-4">
<h4 id="orgbe37290"><span class="todo TODO">TODO</span> Animasjon SFD</h4>
<div class="outline-text-4" id="text-orgbe37290">
<p>
À la Wikipedias <a href="https://no.wikipedia.org/wiki/St%C3%B8rste_felles_divisor">Største felles divisor</a>.
</p>
</div>
<ul class="org-ul">
<li><a id="orgd648724"></a><span class="todo TODO">TODO</span> Legge inn ImageMagick<br />
<div class="outline-text-5" id="text-orgd648724">
<p>
<a href="https://www.imagemagick.org/script/download.php#windows">https://www.imagemagick.org/script/download.php#windows</a>
</p>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org5a5ab20" class="outline-3">
<h3 id="org5a5ab20">Kilder</h3>
<div class="outline-text-3" id="text-org5a5ab20">
<p>
<a href="https://no.wikipedia.org/wiki/St%C3%B8rste_felles_divisor">Største felles divisor</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
